#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_role.neptune_role will be created
  + resource "aws_iam_role" "neptune_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "rds.amazonaws.com",
                            ]
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "neptune_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_neptune_cluster.neptune_cluster will be created
  + resource "aws_neptune_cluster" "neptune_cluster" {
      + allow_major_version_upgrade          = (known after apply)
      + apply_immediately                    = true
      + arn                                  = (known after apply)
      + availability_zones                   = (known after apply)
      + backup_retention_period              = 1
      + cluster_identifier                   = "neptune-cluster"
      + cluster_identifier_prefix            = (known after apply)
      + cluster_members                      = (known after apply)
      + cluster_resource_id                  = (known after apply)
      + endpoint                             = (known after apply)
      + engine                               = "neptune"
      + engine_version                       = "1.2.0.2"
      + hosted_zone_id                       = (known after apply)
      + iam_roles                            = (known after apply)
      + id                                   = (known after apply)
      + kms_key_arn                          = (known after apply)
      + neptune_cluster_parameter_group_name = "default.neptune1.2"
      + neptune_subnet_group_name            = (known after apply)
      + port                                 = 8182
      + preferred_backup_window              = (known after apply)
      + preferred_maintenance_window         = (known after apply)
      + reader_endpoint                      = (known after apply)
      + skip_final_snapshot                  = true
      + storage_encrypted                    = false
      + tags_all                             = (known after apply)
      + vpc_security_group_ids               = (known after apply)

      + serverless_v2_scaling_configuration {
          + max_capacity = 128
          + min_capacity = 2.5
        }
    }

  # aws_neptune_cluster_instance.neptune_instance will be created
  + resource "aws_neptune_cluster_instance" "neptune_instance" {
      + address                      = (known after apply)
      + apply_immediately            = (known after apply)
      + arn                          = (known after apply)
      + auto_minor_version_upgrade   = true
      + availability_zone            = (known after apply)
      + cluster_identifier           = "neptune-cluster"
      + dbi_resource_id              = (known after apply)
      + endpoint                     = (known after apply)
      + engine                       = "neptune"
      + engine_version               = (known after apply)
      + id                           = (known after apply)
      + identifier                   = (known after apply)
      + identifier_prefix            = (known after apply)
      + instance_class               = "db.serverless"
      + kms_key_arn                  = (known after apply)
      + neptune_parameter_group_name = "default.neptune1.2"
      + neptune_subnet_group_name    = (known after apply)
      + port                         = 8182
      + preferred_backup_window      = (known after apply)
      + preferred_maintenance_window = (known after apply)
      + promotion_tier               = 0
      + publicly_accessible          = false
      + storage_encrypted            = (known after apply)
      + tags_all                     = (known after apply)
      + writer                       = (known after apply)
    }

  # aws_s3_bucket.import_bucket will be created
  + resource "aws_s3_bucket" "import_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "neptune-csv-import-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = (known after apply)

              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  + sse_algorithm     = (known after apply)
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

  # aws_s3_bucket_public_access_block.import_bucket_public_access_block will be created
  + resource "aws_s3_bucket_public_access_block" "import_bucket_public_access_block" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_ssm_parameter.neptune_endpoint will be created
  + resource "aws_ssm_parameter" "neptune_endpoint" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "neptune_endpoint"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_vpc_endpoint.s3 will be created
  + resource "aws_vpc_endpoint" "s3" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = false
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.eu-west-1.s3"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = "vpc-1836c261"

      + dns_options {
          + dns_record_ip_type = (known after apply)
        }
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + neptune_endpoint = (known after apply)
  + neptune_role_arn = (known after apply)
  + s3_import_bucket = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @gary-alway, Action: `pull_request`*